;---------------------------------------------------------------------------------------
;  FILE:   WOTC_RandomAndromReboot.localisation
;
;	CREATED BY RustyDios
;           
;	File created	24/12/20	20:30
;	LAST UPDATED    24/03/21    01:00
;  
;   localisation for ABA prime unit and AHW Dreadnaughts use the below too, sweet!
;
;---------------------------------------------------------------------------------------

[RobotBattlesuit X2AbilityTemplate]
;LocFriendlyName="Robot Battlesuit"
;LocFlyOverText="Robot Battlesuit"

-LocLongDescription="An Andromedon's Battlesuit has a tactical AI that will take over control if the pilot is incapacitated or killed."
+LocLongDescription="An Andromedon's Battlesuit has a tactical AI that may take over control if the pilot is incapacitated or killed. It sometimes malfunctions and may even fight for our side."

-LocHelpText="The Andromedon's Battlesuit will continue fighting, even after death."
+LocHelpText="The Andromedon's Battlesuit might continue fighting, even after death."

;=================================================
[AndromedonBulwark X2AbilityTemplate]
LocFriendlyName="Bulwark"
LocLongDescription="Always provide high cover to all adjacent allies."
LocHelpText="Always provide high cover to all adjacent allies."
LocPromotionPopupText="<Bullet/> Anyone standing adjacent to the Andromedon will gain the high cover defense bonus.<br/>"

;=================================================
;technically not needed as it should never be seen, but included just in case
[RebootCoverStatue X2AbilityTemplate]
LocFriendlyName="Robot Death Statue"
LocLongDescription="An Andromedon's Battlesuit might turn into a statue on reboot 'death'."
LocHelpText="The Andromedon's Battlesuit might turn into a statue on reboot 'death'."
;LocFlyOverText="BattleSuit Malfunction!"

;=================================================
;yes an oversight, this was needed so you could 'evac' a shell
[AndromedonEvacDeath X2AbilityTemplate]
LocFriendlyName="Short Circuit Shutdown"
LocLongDescription="The battlesuit can be forced to Short Circuit. It will become a 'cover statue', considered destroyed."
LocHelpText="The battlesuit can be forced to Short Circuit. It will become a 'cover statue', considered destroyed."
